Repository: Kun686/iTerm2-CN
Catalog: sources/TIps/iTermTipData.xcstrings
Source language: en
Languages: zh_hans

# ui.tips.data.000.body
source: This window shows the iTerm2 tip of the day. It’ll appear every 24 hours to let you know about new features and hidden secrets. Hit “More Options” to view more tips or to stop getting them altogether.
zh_hans: 此窗口显示 iTerm2 的每日提示。它每 24 小时出现一次，向你介绍新功能和隐藏技巧。点击“更多选项”可查看更多提示，或完全停止接收这些提示。

# ui.tips.data.000.title
source: Tip of the Day
zh_hans: 每日提示

# ui.tips.data.0000.body
source: The big new feature of iTerm2 version 3 is Shell Integration. Click “Learn More” for all the details.
zh_hans: iTerm2 版本 3 的一项重大新功能是 Shell 集成。点击“了解更多”查看所有详细信息。

# ui.tips.data.0000.title
source: Shell Integration
zh_hans: Shell 集成

# ui.tips.data.0001.body
source: “View > Show Timestamps” shows the time (and date, if appropriate) when each line was last modified.
zh_hans: “显示 > 显示时间戳”会显示每行上次修改的时间（适当时还会显示日期）。

# ui.tips.data.0001.title
source: Timestamps
zh_hans: 时间戳

# ui.tips.data.0002.body
source: Did you know iTerm2 has a password manager? Open it with “Window > Password Manager.” You can define a Trigger to open it for you at a password prompt in “Settings > Profiles > Advanced > Triggers.”
zh_hans: 你知道 iTerm2 也有密码管理器吗？通过“窗口 > 密码管理器”打开它。你可以在“设置 > 配置文件 > 高级 > 触发器”中定义一个触发器，让密码提示出现时自动打开密码管理器。

# ui.tips.data.0002.title
source: Password Manager
zh_hans: 密码管理器

# ui.tips.data.0003.body
source: You can quickly search through your sessions with “View > Open Quickly” (⇧⌘O). You can type a query and sessions whose name, badge, current hostname, current user name, recent commands, and recent working directories match will be surfaced. It works best with Shell Integration so the user name, hostname, command, and directories can be known even while sshed.
zh_hans: 你可以使用“显示 > 快速打开” (⇧⌘O) 快速搜索会话。输入查询后，名称、徽标、当前主机名、当前用户名、最近命令或最近工作目录相匹配的会话就会显示出来。配合 Shell 集成效果最佳，这样即使通过 SSH 连接，也能获知用户名、主机名、命令和目录。

# ui.tips.data.0003.title
source: Open Quickly
zh_hans: 快速打开

# ui.tips.data.0004.body
source: If you close a session, tab, or window by accident you can undo it with “Edit > Undo” (⌘Z). By default you have five seconds to undo, but you can adjust that timeout in “Settings > Profiles > Session.”
zh_hans: 如果误关会话、标签页或窗口，可使用“编辑 > 撤销” (⌘Z) 恢复。默认有五秒可撤销，你可以在“设置 > 配置文件 > 会话”中调整超时时间。

# ui.tips.data.0004.title
source: Undo Close
zh_hans: 撤销关闭

# ui.tips.data.0005.body
source: Want to mark up your scrollback history? Right click on a selection and choose “Annotate Selection” to add a personal note to it. Use “View > Show Annotations” to show or hide them, and look in “Edit > Marks and Annotations” for more things you can do.
zh_hans: 想为回滚历史添加标记吗？右键点按所选内容并选择“注释所选内容”，即可添加个人注释。使用“显示 > 显示注释”显示或隐藏注释；在“编辑 > 标记与注释”中还能找到更多操作。

# ui.tips.data.0005.title
source: Annotations
zh_hans: 注释

# ui.tips.data.0006.body
source: Copy a selection with ⌥⌘C to include styles such as colors and fonts. You can make this the default action for Copy in “Settings > Advanced.”
zh_hans: 按 ⌥⌘C 拷贝所选内容，同时保留颜色、字体等样式。你可以在“设置 > 高级”中将其设为“拷贝”的默认操作。

# ui.tips.data.0006.title
source: Copy with Styles
zh_hans: 拷贝（含样式）

# ui.tips.data.0007.body
source: iTerm2 can display images (even animated GIFs) inline.
zh_hans: iTerm2 可以在终端中直接显示图像（包括动态 GIF）。

# ui.tips.data.0007.title
source: Inline Images
zh_hans: 内嵌图像

# ui.tips.data.0008.body
source: Automatic Profile Switching changes the current profile when the username, hostname, or directory changes. Set it up in “Settings > Profiles > Advanced.” It requires Shell Integration to be installed.
zh_hans: 当用户名、主机名或目录发生变化时，“自动切换配置文件”会更改当前配置文件。可在“设置 > 配置文件 > 高级”中设置。使用此功能需要安装 Shell 集成。

# ui.tips.data.0008.title
source: Automatic Profile Switching
zh_hans: 自动切换配置文件

# ui.tips.data.0009.body
source: iTerm2 can act like an IDE using the Captured Output feature. When it sees text matching a regular expression you define, like compiler errors, it shows the matching lines in the Toolbelt. You can click to jump to the line in your terminal and double-click to perform an action like opening an editor to the line with the error.
zh_hans: 借助“捕获输出”功能，iTerm2 可以像 IDE 一样工作。当它发现与你定义的正则表达式相匹配的文本（如编译器错误）时，会在工具侧栏显示相应行。单击可跳至终端中的该行，双击可执行某项操作，例如在编辑器中打开错误所在行。

# ui.tips.data.0009.title
source: Captured Output
zh_hans: 捕获输出

# ui.tips.data.0010.body
source: You can display a status message in the top right of your session in the background. It’s called a “Badge.” If you install Shell Integration you can include info like user name, hostname, current directory, and more.
zh_hans: 你可以在会话右上角以背景形式显示状态信息，这称为“徽标”。安装 Shell 集成后，可包含用户名、主机名、当前目录等信息。

# ui.tips.data.0010.title
source: Badges
zh_hans: 徽标

# ui.tips.data.0011.body
source: Dynamic Profiles let you store your profiles as one or more JSON files. It’s great for batch creating and editing profiles.
zh_hans: 动态配置文件可让你将配置文件存储为一个或多个 JSON 文件，非常适合批量创建和编辑配置文件。

# ui.tips.data.0011.title
source: Dynamic Profiles
zh_hans: 动态配置文件

# ui.tips.data.0012.body
source: “Edit > Paste Special > Advanced Paste” lets you preview and edit text before you paste. You get to tweak options, like how to handle control codes, or even to base-64 encode before pasting.
zh_hans: “编辑 > 粘贴特殊 > 高级粘贴”可让你在粘贴前预览和编辑文本。你可以调整控制代码处理方式等选项，甚至可在粘贴前进行 Base64 编码。

# ui.tips.data.0012.title
source: Advanced Paste
zh_hans: 高级粘贴

# ui.tips.data.0013.body
source: Ever wanted to focus on a block of lines without distraction, or limit Find to a single command’s output? Select the lines and choose “View > Zoom In on Selection.” The session’s contents will be temporarily replaced with the selection. Press “esc” to unzoom.
zh_hans: 是否想专注查看一段内容而不受干扰，或将“查找”范围限制在单条命令的输出中？选择这些行，再选取“显示 > 缩放到所选内容”。会话内容将暂时替换为所选内容。按 Esc 可退出缩放。

# ui.tips.data.0013.title
source: Zoom
zh_hans: 缩放

# ui.tips.data.0014.body
source: The “Semantic History” feature allows you to ⌘-click on a file or URL to open it.
zh_hans: “语义历史”功能让你可以按住 ⌘ 并点按文件或 URL 来打开它。

# ui.tips.data.0014.title
source: Semantic History
zh_hans: 语义历史

# ui.tips.data.0015.body
source: If you use tmux, try running “tmux -CC” to get iTerm2’s tmux integration mode. The tmux windows show up as native iTerm2 windows, and you can use iTerm2’s keyboard shortcuts. It even works over ssh!
zh_hans: 如果使用 tmux，请尝试运行“tmux -CC”以进入 iTerm2 的 tmux 集成模式。tmux 窗口会显示为原生 iTerm2 窗口，你也可以使用 iTerm2 的键盘快捷键。通过 SSH 连接时同样有效！

# ui.tips.data.0015.title
source: Tmux Integration
zh_hans: tmux 集成

# ui.tips.data.0016.body
source: iTerm2 can automatically perform actions you define when text matching a regular expression is received. For example, you can highlight text or show an alert box. Set it up in “Settings > Profiles > Advanced > Triggers.”
zh_hans: 收到与所定义正则表达式匹配的文本时，iTerm2 可自动执行你指定的操作。例如，高亮文本或显示提醒框。可在“设置 > 配置文件 > 高级 > 触发器”中设置。

# ui.tips.data.0016.title
source: Triggers
zh_hans: 触发器

# ui.tips.data.0017.body
source: Quadruple click to perform Smart Selection. It figures out if you’re selecting a URL, filename, email address, etc. based on prioritized regular expressions.
zh_hans: 连按四次可执行智能选择。它会根据按优先级排列的正则表达式，判断你选择的是 URL、文件名、电子邮件地址等内容。

# ui.tips.data.0017.title
source: Smart Selection
zh_hans: 智能选择

# ui.tips.data.0018.body
source: Press ⌥⌘B to step back in time in a terminal window. Use arrow keys to go frame by frame. Hold ⇧ and press arrow keys to go faster.
zh_hans: 在终端窗口中按 ⌥⌘B 可回到之前的画面。使用箭头键逐帧查看；按住 ⇧ 再按箭头键可加快速度。

# ui.tips.data.0018.title
source: Instant Replay
zh_hans: 即时回放

# ui.tips.data.0019.body
source: You can have a terminal window open with a keystroke, even while in other apps. Click “Create a Dedicated Hotkey Window” in “Settings > Keys.”
zh_hans: 即使正在使用其他 App，也可以按一个快捷键打开终端窗口。在“设置 > 按键”中点击“创建专用热键窗口”。

# ui.tips.data.0019.title
source: Hotkey Window
zh_hans: 热键窗口

# ui.tips.data.0020.body
source: Hotkey windows can stay open after losing focus. Turn it on in “Window > Pin Hotkey Window.”
zh_hans: 热键窗口失去焦点后仍可保持打开。可在“窗口 > 固定热键窗口”中启用。

# ui.tips.data.0020.title
source: Hotkey Window
zh_hans: 热键窗口

# ui.tips.data.0021.body
source: The cursor guide is a horizontal line that follows your cursor. You can turn it on in “Settings > Profiles > Colors” or toggle it with the ⌥⌘; shortcut.
zh_hans: 光标辅助线是一条跟随光标的水平线。可在“设置 > 配置文件 > 颜色”中启用，或按 ⌥⌘; 切换。

# ui.tips.data.0021.title
source: Cursor Guide
zh_hans: 光标辅助线

# ui.tips.data.0022.body
source: The Shell Integration feature lets you ask to be alerted (⌥⌘A) when a long-running command completes.
zh_hans: Shell 集成功能可在长时间运行的命令完成时通知你（⌥⌘A）。

# ui.tips.data.0022.title
source: Shell Integration: Alerts
zh_hans: Shell 集成：提醒

# ui.tips.data.0023.body
source: You can configure how quickly the cursor blinks in “Settings > Advanced.”
zh_hans: 可在“设置 > 高级”中配置光标的闪烁速度。

# ui.tips.data.0023.title
source: Cursor Blink Rate
zh_hans: 光标闪烁速率

# ui.tips.data.0024.body
source: The Shell Integration feature lets you navigate among shell prompts with ⇧⌘↑ and ⇧⌘↓.
zh_hans: Shell 集成功能让你可以使用 ⇧⌘↑ 和 ⇧⌘↓ 在 Shell 提示符之间导航。

# ui.tips.data.0024.title
source: Shell Integration: Navigation
zh_hans: Shell 集成：导航

# ui.tips.data.0025.body
source: The Shell Integration feature puts a blue arrow next to your shell prompt. If you run a command that fails, it turns red. Right click on it to get the running time and status.
zh_hans: Shell 集成功能会在 Shell 提示符旁显示蓝色箭头。命令执行失败时，箭头会变为红色。右键点按箭头可查看运行时间和状态。

# ui.tips.data.0025.title
source: Shell Integration: Status
zh_hans: Shell 集成：状态

# ui.tips.data.0026.body
source: With Shell Integration installed, you can select the output of the last command with ⇧⌘A.
zh_hans: 安装 Shell 集成后，可按 ⇧⌘A 选择上一条命令的输出。

# ui.tips.data.0026.title
source: Shell Integration: Selection
zh_hans: Shell 集成：选择

# ui.tips.data.0027.body
source: The dock icon shows a count of the number of bells rung and notifications posted since the app was last active.
zh_hans: 程序坞图标会显示自 App 上次处于活跃状态以来的响铃次数和已发送通知数。

# ui.tips.data.0027.title
source: Bells
zh_hans: 响铃

# ui.tips.data.0028.body
source: If you install Shell Integration on a machine you ssh to, you can right click on a filename (for example, in the output of “ls”) and choose “Download with scp” to download the file.
zh_hans: 如果在通过 SSH 连接的机器上安装了 Shell 集成，可以右键点按文件名（例如“ls”的输出中），然后选择“使用 scp 下载”来下载文件。

# ui.tips.data.0028.title
source: Shell Integration: Downloads
zh_hans: Shell 集成：下载

# ui.tips.data.0029.body
source: Press ⌘/ to locate your cursor. It’s fun!
zh_hans: 按 ⌘/ 定位光标。很有趣！

# ui.tips.data.0029.title
source: Find Your Cursor
zh_hans: 查找光标

# ui.tips.data.0030.body
source: You can edit Smart Selection regular expressions in “Settings > Profiles > Advanced > Smart Selection.”
zh_hans: 可在“设置 > 配置文件 > 高级 > 智能选择”中编辑智能选择的正则表达式。

# ui.tips.data.0030.title
source: Customize Smart Selection
zh_hans: 自定义智能选择

# ui.tips.data.0031.body
source: Assign an action to a Smart Selection rule in “Settings > Profiles > Advanced > Smart Selection > Edit Actions.” They go in the context menu and override semantic history on ⌘-click.
zh_hans: 在“设置 > 配置文件 > 高级 > 智能选择 > 编辑动作”中为智能选择规则指定动作。这些动作会出现在上下文菜单中，并在按住 ⌘ 点按时覆盖语义历史行为。

# ui.tips.data.0031.title
source: Smart Selection Actions
zh_hans: 智能选择动作

# ui.tips.data.0032.body
source: If you want the visual bell to flash the whole screen instead of show a bell icon, you can turn that on in “Settings > Advanced.”
zh_hans: 如果希望可视响铃闪烁整个屏幕，而不是显示响铃图标，可在“设置 > 高级”中启用。

# ui.tips.data.0032.title
source: Visual Bell
zh_hans: 可视响铃

# ui.tips.data.0033.body
source: Right click on a tab to change its color, close tabs after it, or to close all other tabs.
zh_hans: 右键点按标签页可更改其颜色、关闭其后的标签页，或关闭其他所有标签页。

# ui.tips.data.0033.title
source: Tab Menu
zh_hans: 标签页菜单

# ui.tips.data.0034.body
source: You can assign tags to your profiles, and by clicking “Tags>” anywhere you see a list of profiles you can browse those tags.
zh_hans: 你可以为配置文件指定标签。在任何配置文件列表中点击“标签>”，即可按标签浏览。

# ui.tips.data.0034.title
source: Tags
zh_hans: 标签

# ui.tips.data.0035.body
source: If you put a slash in a profile’s tag, that implicitly defines a hierarchy. You can see it in the Profiles menu as nested submenus.
zh_hans: 在配置文件标签中加入斜杠即可隐式定义层级；它会在“配置文件”菜单中显示为嵌套子菜单。

# ui.tips.data.0035.title
source: Tag Hierarchy
zh_hans: 标签层级

# ui.tips.data.0036.body
source: iTerm2 can download files by base-64 encoding them. Click “Learn More” to download a shell script that makes it easy.
zh_hans: iTerm2 可以通过 Base64 编码下载文件。点击“了解更多”可下载一个简化操作的 Shell 脚本。

# ui.tips.data.0036.title
source: Downloads
zh_hans: 下载

# ui.tips.data.0037.body
source: If you install Shell Integration, ⇧⌘; helps you complete commands. It remembers the commands you’ve run on each host that has Shell Integration installed. It knows how often that command was run and how recently to help make the best suggestions.
zh_hans: 安装 Shell 集成后，可按 ⇧⌘; 补全命令。系统会记住每台已安装 Shell 集成的主机上运行过的命令，并根据命令的运行频率和最近使用时间提供最佳建议。

# ui.tips.data.0037.title
source: Command Completion
zh_hans: 命令补全

# ui.tips.data.0038.body
source: iTerm2 remembers which directories you use the most on each host that has Shell Integration installed. There’s a Toolbelt tool to browse them, and ⌥⌘/ gives you a popup sorted by frequency and recency of use.
zh_hans: iTerm2 会记住每台已安装 Shell 集成的主机上最常使用的目录。工具侧栏中有用于浏览这些目录的工具；按 ⌥⌘/ 可打开弹出窗口，并按使用频率和最近使用时间排序。

# ui.tips.data.0038.title
source: Recent Directories
zh_hans: 最近使用的目录

# ui.tips.data.0039.body
source: If you have Shell Integration installed, you can “star” a directory to keep it always at the bottom of the Recent Directories tool in the Toolbelt. Right click and choose “Toggle Star.”
zh_hans: 安装 Shell 集成后，可以为目录添加“星标”，使其始终显示在工具侧栏“最近使用的目录”工具底部。右键点按并选择“切换星标”。

# ui.tips.data.0039.title
source: Favorite Directories
zh_hans: 收藏的目录

# ui.tips.data.0040.body
source: Install Shell Integration and turn on “Settings > General > Save copy/paste and command history to disk” to remember command history per host across restarts of iTerm2.
zh_hans: 安装 Shell 集成并启用“设置 > 通用 > 将复制/粘贴和命令历史记录保存到磁盘”，即可在 iTerm2 重启后继续保留各主机的命令历史记录。

# ui.tips.data.0040.title
source: Shell Integration History
zh_hans: Shell 集成历史记录

# ui.tips.data.0041.body
source: Copy a file to the pasteboard in Finder and then use “Edit > Paste Special > Paste File Base64-Encoded” for easy uploads of binary files. Use ”base64 -D” (or -d on Linux) on the remote host to decode it.
zh_hans: 在 Finder 中将文件拷贝到剪贴板，然后使用“编辑 > 粘贴特殊 > 以 Base64 编码粘贴文件”，即可轻松上传二进制文件。在远程主机上使用“base64 -D”（Linux 上使用 -d）进行解码。

# ui.tips.data.0041.title
source: Paste File as Base64
zh_hans: 以 Base64 粘贴文件

# ui.tips.data.0042.body
source: You can split a tab into multiple panes with ⌘D and ⇧⌘D.
zh_hans: 可以使用 ⌘D 和 ⇧⌘D 将一个标签页分成多个窗格。

# ui.tips.data.0042.title
source: Split Panes
zh_hans: 分割窗格

# ui.tips.data.0043.body
source: Resize split panes with the keyboard using ^⌘-Arrow Key.
zh_hans: 使用 ^⌘-箭头键通过键盘调整分割窗格大小。

# ui.tips.data.0043.title
source: Adjust Split Panes
zh_hans: 调整分割窗格

# ui.tips.data.0044.body
source: Hold ⌥ and click to move your cursor. It works best with Shell Integration installed (to avoid sending up/down arrow keys to your shell).
zh_hans: 按住 ⌥ 并点按可移动光标。安装 Shell 集成后效果最佳（可避免向 Shell 发送上下箭头键）。

# ui.tips.data.0044.title
source: Move Cursor
zh_hans: 移动光标

# ui.tips.data.0045.body
source: You can tell your profile to create windows that are attached to one edge of the screen in “Settings > Profiles > Window.” You can resize them by dragging the edges.
zh_hans: 可在“设置 > 配置文件 > 窗口”中，让配置文件创建贴靠屏幕某一边缘的窗口。拖动边缘即可调整窗口大小。

# ui.tips.data.0045.title
source: Edge Windows
zh_hans: 屏幕边缘窗口

# ui.tips.data.0046.body
source: You can assign colors to tabs in “Settings > Profiles > Colors,” or in the View menu.
zh_hans: 可在“设置 > 配置文件 > 颜色”或“显示”菜单中为标签页指定颜色。

# ui.tips.data.0046.title
source: Tab Color
zh_hans: 标签页颜色

# ui.tips.data.0047.body
source: Hold ⌥⌘ while dragging to make a rectangular selection.
zh_hans: 按住 ⌥⌘ 并拖动可进行矩形选择。

# ui.tips.data.0047.title
source: Rectangular Selection
zh_hans: 矩形选择

# ui.tips.data.0048.body
source: Hold ⌘ while dragging to make multiple discontinuous selections.
zh_hans: 按住 ⌘ 并拖动可进行多个不连续的选择。

# ui.tips.data.0048.title
source: Multiple Selection
zh_hans: 多重选择

# ui.tips.data.0049.body
source: Hold ⇧⌥⌘ and drag a session into another session to create or change split panes.
zh_hans: 按住 ⇧⌥⌘，将一个会话拖入另一个会话，即可创建或更改分割窗格。

# ui.tips.data.0049.title
source: Dragging Panes
zh_hans: 拖动窗格

# ui.tips.data.0050.body
source: Adjust Cursor Boost in “Settings > Profiles > Colors” to make all colors more muted, except the cursor. Use a bright white cursor and it pops!
zh_hans: 在“设置 > 配置文件 > 颜色”中调整“光标增强”，可以减弱光标以外的所有颜色。使用亮白色光标会格外醒目！

# ui.tips.data.0050.title
source: Cursor Boost
zh_hans: 光标增强

# ui.tips.data.0051.body
source: Adjust “Minimum Contrast” in “Settings > Profiles > Colors” to ensure text is always legible regardless of text/background color combination.
zh_hans: 在“设置 > 配置文件 > 颜色”中调整“最低对比度”，确保无论文字与背景如何配色，文字始终清晰可读。

# ui.tips.data.0051.title
source: Minimum Contrast
zh_hans: 最低对比度

# ui.tips.data.0052.body
source: Normally, new tabs appear at the end of the tab bar. There’s a setting in “Settings > Advanced” to place them next to your current tab.
zh_hans: 通常，新标签页会出现在标签栏末尾。“设置 > 高级”中有一项设置，可让新标签页出现在当前标签页旁边。

# ui.tips.data.0052.title
source: Tabs
zh_hans: 标签页

# ui.tips.data.0053.body
source: Right-click on a number and the context menu shows it converted to hex or decimal as appropriate.
zh_hans: 右键点按数字，上下文菜单会根据情况显示其十六进制或十进制转换结果。

# ui.tips.data.0053.title
source: Base Conversion
zh_hans: 进制转换

# ui.tips.data.0054.body
source: In “Settings > Keys” you can assign a keystroke to a search for a regular expression with the “Find Regular Expression…” action.
zh_hans: 在“设置 > 按键”中，可以为使用“查找正则表达式…”动作的正则表达式搜索指定快捷键。

# ui.tips.data.0054.title
source: Saved Searches
zh_hans: 已保存的搜索

# ui.tips.data.0055.body
source: Search for URLs using “Edit > Find > Find URLs.” Navigate search results with ⌘G and ⇧⌘G. Open the current selection with ⌥⌘O.
zh_hans: 使用“编辑 > 查找 > 查找 URL”搜索 URL。按 ⌘G 和 ⇧⌘G 浏览搜索结果，按 ⌥⌘O 打开当前所选内容。

# ui.tips.data.0055.title
source: Find URLs
zh_hans: 查找 URL

# ui.tips.data.0056.body
source: The “instant” checkbox in a Trigger allows it to fire while the cursor is on the same line as the text that matches your regular expression.
zh_hans: 触发器中的“即时”复选框允许它在光标仍位于与正则表达式匹配文本的同一行时触发。

# ui.tips.data.0056.title
source: Triggers
zh_hans: 触发器

# ui.tips.data.0057.body
source: Turn on “Edit > Selection Respects Soft Boundaries” to recognize split pane dividers in programs like vi, emacs, and tmux so you can select multiple lines of text.
zh_hans: 启用“编辑 > 所选内容遵循软边界”，即可识别 vi、emacs 和 tmux 等程序中的分割窗格分隔线，从而选择多行文本。

# ui.tips.data.0057.title
source: Soft Boundaries
zh_hans: 软边界

# ui.tips.data.0058.body
source: Single click where you want to start a selection and ⇧-click where you want it to end to select text without dragging.
zh_hans: 在选择起点单击，再按住 ⇧ 点按终点，即可无需拖动地选择文本。

# ui.tips.data.0058.title
source: Select Without Dragging
zh_hans: 无需拖动即可选择

# ui.tips.data.0059.body
source: Hold ^ while resizing a window and it won’t snap to the character grid: you can make it any size you want.
zh_hans: 调整窗口大小时按住 ^，窗口就不会吸附到字符网格，可以设为任意大小。

# ui.tips.data.0059.title
source: Smooth Window Resizing
zh_hans: 平滑调整窗口大小

# ui.tips.data.0060.body
source: If you paste text containing tabs, you’ll be asked if you want to convert them to spaces. It’s handy at the shell prompt to avoid triggering filename completion.
zh_hans: 粘贴包含制表符的文本时，系统会询问是否将其转换为空格。在 Shell 提示符下，这有助于避免意外触发文件名补全。

# ui.tips.data.0060.title
source: Pasting Tabs
zh_hans: 粘贴制表符

# ui.tips.data.0061.body
source: Did you know? If the bell rings too often, you’ll be asked if you’d like to silence it temporarily. iTerm2 cares about your comfort.
zh_hans: 你知道吗？如果响铃过于频繁，系统会询问是否暂时静音。iTerm2 也关心你的使用体验。

# ui.tips.data.0061.title
source: Bell Silencing
zh_hans: 静音响铃

# ui.tips.data.0062.body
source: Every list of profiles has a search field (e.g., in ”Settings > Profiles.”) You can use various operators to restrict your search query. Click “Learn More” for all the details.
zh_hans: 每个配置文件列表都有搜索栏（例如“设置 > 配置文件”）。你可以使用多种运算符限制搜索查询。点击“了解更多”查看所有详细信息。

# ui.tips.data.0062.title
source: Profile Search
zh_hans: 配置文件搜索

# ui.tips.data.0063.body
source: The online color gallery features over one hundred beautiful color schemes you can download.
zh_hans: 在线配色图库提供一百多种精美的配色方案供你下载。

# ui.tips.data.0063.title
source: Color Schemes
zh_hans: 配色方案

# ui.tips.data.0064.body
source: You can have a separate font for ASCII versus non-ASCII text. Enable it in “Settings > Profiles > Text.”
zh_hans: 可以分别为 ASCII 与非 ASCII 文本设置不同字体。在“设置 > 配置文件 > 文本”中启用。

# ui.tips.data.0064.title
source: ASCII/Non-Ascii Fonts
zh_hans: ASCII/非 ASCII 字体

# ui.tips.data.0065.body
source: A coprocess is a job, such as a shell script, that has a special relationship with a particular iTerm2 session. All output in a terminal window (that is, what you see on the screen) is also input to the coprocess. All output from the coprocess acts like text that the user is typing at the keyboard.
zh_hans: 协进程是一项任务（例如 Shell 脚本），它与特定 iTerm2 会话具有特殊关系。终端窗口中的所有输出（即屏幕上看到的内容）同时也会作为协进程的输入。协进程的所有输出则如同用户通过键盘输入的文本。

# ui.tips.data.0065.title
source: Coprocesses
zh_hans: 协进程

# ui.tips.data.0066.body
source: You can customize the touch bar by selecting “View > Customize Touch Bar.” You can add a tab bar for full-screen mode, a user-customizable status button, and you can even define your own touch bar buttons in Settings > Keys. There’s also a new shell integration tool to customize touch bar function key labels.
zh_hans: 选择“显示 > 自定义触控栏”可自定义触控栏。你可以为全屏模式添加标签栏和可由用户自定义的状态按钮，甚至可以在“设置 > 按键”中定义自己的触控栏按钮。此外还有一项新的 Shell 集成工具，可自定义触控栏功能键标签。

# ui.tips.data.0066.title
source: Touch Bar Customization
zh_hans: 自定义触控栏

# ui.tips.data.0067.body
source: If you use a font that supports ligatures, you can enable ligature support in Settings > Profiles > Text.
zh_hans: 如果字体支持连字，可在“设置 > 配置文件 > 文本”中启用连字支持。

# ui.tips.data.0067.title
source: Ligatures
zh_hans: 连字

# ui.tips.data.0068.body
source: New in 3.1: You can configure your hotkey window to appear over other apps’ full screen windows. Turn on “Floating Window” in “Settings > Profiles > Keys > Customize Hotkey Window.”
zh_hans: 3.1 新增：可将热键窗口设为显示在其他 App 的全屏窗口之上。在“设置 > 配置文件 > 按键 > 自定义热键窗口”中启用“浮动窗口”。

# ui.tips.data.0068.title
source: Floating Hotkey Window
zh_hans: 浮动热键窗口

# ui.tips.data.0069.body
source: New in 3.1: You can have multiple hotkey windows. Each profile can have one or more hotkeys.
zh_hans: 3.1 新增：可以使用多个热键窗口。每个配置文件可有一个或多个热键。

# ui.tips.data.0069.title
source: Multiple Hotkey Windows
zh_hans: 多个热键窗口

# ui.tips.data.0070.body
source: New in 3.1: You can configure a hotkey window to open on double-tap of a modifier in “Settings > Profiles > Keys > Customize Hotkey Window.”
zh_hans: 3.1 新增：可在“设置 > 配置文件 > 按键 > 自定义热键窗口”中，将热键窗口配置为连按两次修饰键时打开。

# ui.tips.data.0070.title
source: Double-Tap Hotkey
zh_hans: 连按两次修饰键

# ui.tips.data.0071.body
source: You can “bury” a session with “Session > Bury Session.” It remains hidden until you restore it by selecting it from “Session > Buried Sessions > Your session.”
zh_hans: 可以使用“会话 > 隐藏会话”将会话“隐藏”。它会一直保持隐藏，直到你从“会话 > 已隐藏的会话 > 你的会话”中选择并恢复它。

# ui.tips.data.0071.title
source: Buried Sessions
zh_hans: 已隐藏的会话

# ui.tips.data.0072.body
source: You can add custom behavior to iTerm2 using the Python API.
zh_hans: 你可以使用 Python API 为 iTerm2 添加自定义行为。

# ui.tips.data.0073.body
source: You can add a configurable status bar to your terminal windows.
zh_hans: 可以为终端窗口添加可配置的状态栏。

# ui.tips.data.0073.title
source: Status Bar
zh_hans: 状态栏

# ui.tips.data.0074.body
source: Try the “Minimal” and “Compact” themes to reduce visual clutter. You can set it in “Settings > Appearance > General.”
zh_hans: 试用“精简”和“紧凑”主题以减少视觉干扰。可在“设置 > 外观 > 通用”中设置。

# ui.tips.data.0074.title
source: Minimal Theme
zh_hans: 精简主题

# ui.tips.data.0076.body
source: You can configure which elements are present in session titles in “Settings > Profiles > General > Title.”
zh_hans: 可在“设置 > 配置文件 > 通用 > 标题”中配置会话标题包含哪些元素。

# ui.tips.data.0076.title
source: Session Titles
zh_hans: 会话标题
